# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.


print('Ваша буква - ', chr(int(input('Введите номер буквы в англ.алфавите от 1 до 26:')) + 64))
